#coding:utf-8
#计算商店卡牌递增价格的算法
# start=1980050
# price=2000
# res=[]
# for i in xrange(0,210,10):
# 	w=start-(price+price*i/100)
# 	start=w
# 	res.append(start)
# print resde



# def my_add(*args):
# 	res=0
# 	for a in xrange(len(args)):
# 		res=res+args[a]
# 	print  res
# my_add(6,30,6,68,38,6,30,6,30,30,68,6,6)

# print 'diamond is :',3+120+3600+10800+11800*2+620+840*2
# print 'RMB is :',6+128+328+648+28+66+30+68+8+38+88
# print 5*9*2+13*6*5

#觉醒修改，测试计算公式
first_hp=3141
first_acttack=1123
mylist=[
[100,200,400,600,900,1200,1600,2000,2600,3200],[15,30,50,70,95,120,150,180,220,270],
[100,200,400,600,800,1100,1400,1800,2200,2800],[20,40,65,90,120,150,185,220,260,310],
[200,400,700,1000,1400,1800,2300,2800,3600,4600],[20,40,60,90,120,160,210,270,350,450],
[200,400,700,1000,1400,1800,2300,2800,3400,4200],[20,40,60,90,120,150,190,240,310,400],
[200,400,700,1100,1700,2400,3200,4200,5300,6600],[30,60,440,160,230,300,390,480,600,750],
[200,400,700,1000,1500,2100,2800,3600,4600,5800],[30,60,110,160,230,300,390,480,600,750],
]
print('生命初始值：'),first_hp
for i in xrange(len(mylist[6])):
	res=mylist[6][i]+first_hp
	print res,

print 
print('攻击初始值：'),first_acttack
for i in xrange(len(mylist[7])):
	res=mylist[7][i]+first_acttack
	print res,

print 
print ('话费货币'),708040-200-400-800-1200-2000-3000-4600-6600-9200-12000